Дипломный_проект/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>ВКМ_Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дипломный_проект/src/AccumulationRegisters/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ВКМ_КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Дипломный_проект/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ВКМ_ГрафикОтпусков 
	Движения.ВКМ_ГрафикОтпусков.Записывать = Истина;
	Для Каждого ТекСтрока Из ВКМ_ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_ГрафикОтпусков.Добавить();
		Движение.Период = Дата;
		Движение.ВКМ_Сотрудник = ТекСтрока.ВКМ_Сотрудник;
		Движение.ВКМ_ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск;
		Движение.ВКМ_КоличествоДней = (ТекСтрока.ВКМ_ДатаОкончания - ТекСтрока.ВКМ_ДатаНачала) / 86400;
	КонецЦикла;

КонецПроцедуры
